import hardcoded_icon from "../../public/react_icon.svg";

export const dummydata: Array<IQuizzCard> = [
  {
    icon: hardcoded_icon,
    id: "1",
    name: "გართულებული პითონი",
    difficulty: "საშუალო",
    categories: "პროგრამირება",
  },
  {
    icon: hardcoded_icon,
    id: "2",
    name: "JavaScript დამწყებისთვის",
    difficulty: "მარტივი",
    categories: "პროგრამირება",
  },
  {
    icon: hardcoded_icon,
    id: "3",
    name: "React.js ექსპერტი",
    difficulty: "რთული",
    categories: "პროგრამირება",
  },
  {
    icon: hardcoded_icon,
    id: "4",
    name: "PostgreSQL საფუძვლები",
    difficulty: "მარტივი",
    categories: "მონაცემთა ბაზები",
  },
  {
    icon: hardcoded_icon,
    id: "5",
    name: "HTML/CSS დიზაინის საფუძვლები",
    difficulty: "საშუალო",
    categories: "ვებ დიზაინი",
  },
  {
    icon: hardcoded_icon,
    id: "6",
    name: "Node.js-ით სერვერული პროგრამირება",
    difficulty: "საშუალო",
    categories: "სერვერული პროგრამირება",
  },
  {
    icon: hardcoded_icon,
    id: "7",
    name: "Python-ის მონაცემთა ანალიზი",
    difficulty: "რთული",
    categories: "მონაცემთა ანალიზი",
  },
  {
    icon: hardcoded_icon,
    id: "8",
    name: "გრაფიკული დიზაინი Adobe Photoshop-ით",
    difficulty: "მარტივი",
    categories: "გრაფიკული დიზაინი",
  },
  {
    icon: hardcoded_icon,
    id: "9",
    name: "Machine Learning საფუძვლები",
    difficulty: "საშუალო",
    categories: "ხელოვნური ინტელექტი",
  },
  {
    icon: hardcoded_icon,
    id: "10",
    name: "ვებ უსაფრთხოების პრინციპები",
    difficulty: "რთული",
    categories: "ვებ უსაფრთხოება",
  },
  {
    icon: hardcoded_icon,
    id: "11",
    name: "ქლაუდ კომპიუტინგი AWS-ით",
    difficulty: "საშუალო",
    categories: "ქლაუდ კომპიუტინგი",
  },
  {
    icon: hardcoded_icon,
    id: "12",
    name: "ტექსტის დამუშავება Python-ით",
    difficulty: "მარტივი",
    categories: "პროგრამირება",
  },
  {
    icon: hardcoded_icon,
    id: "13",
    name: "Git და GitHub საფუძვლები",
    difficulty: "მარტივი",
    categories: "ვერსიის კონტროლი",
  },
  {
    icon: hardcoded_icon,
    id: "14",
    name: "Vue.js პროექტის დაწყება",
    difficulty: "საშუალო",
    categories: "პროგრამირება",
  },
  {
    icon: hardcoded_icon,
    id: "15",
    name: "PHP-ის საფუძვლები",
    difficulty: "მარტივი",
    categories: "პროგრამირება",
  },
];

export const dummyQuizz = {
  info: {
    title: "გართულებული ისტორია",
    description: "🚀 ეს არის ქვიზის აღწერა",
  },
  question: "რა მოხდა 1121 წელს?",
  options: [
    {
      id: 1,
      answer: "პატარაგორის შელაპარაკება",
    },
    {
      id: 2,
      answer: "დიდგორის ბრძოლა",
    },
    {
      id: 3,
      answer: "დიდგორის მთის დაპყრობა",
    },
    {
      id: 4,
      answer: "არ ვიცი",
    },
  ],
};